structured-notes.org
# ∅
* Core sentence
   Every sentence is formed of two elements, they are the が-marked noun and the /engine/.

   In all languages there are only two kinds of sentence:
   - A *is* B i.e. Sakura is Japanese
   - A *does* B i.e. Sakura Walks

   #+BEGIN_QUOTE
   さくらが日本人だ - Sakura is Japanese
   #+END_QUOTE
   #+BEGIN_QUOTE
   さくらが歩く - Sakura walks
   #+END_QUOTE

   There are three possible engines:
   - Verb - A does B
   - だ-marked noun - A is B
   - い-"Adjective" ([[*Adjectives]]) - A is B

   The engine *always* comes at the end of the sentence (with the exception of sentence ender particles ([[*Sentence ender particles]]).

   <<Invisible が>>
   The が-marked noun is not always visible in the sentence. It is still present as part of the core of the sentence however. The closest English equivalent to this invisible が is 'it'. Take this example English sentence:
    #+BEGIN_QUOTE
    The ball rolled down the hill. When the ball got to the bottom the ball hit a sharp stone and the ball was punctured and all the air came out of the ball.
    #+END_QUOTE
    This is not a sentence we would ever say in English, once we have established that we are talking about 'the ball' we would instead refer to the ball by 'it':
    #+BEGIN_QUOTE
    The ball rolled down the hill. When it got to the bottom it hit a sharp stone and it was punctured and all the air came out of it.
    #+END_QUOTE
    If we were to completely omit 'it' the sentence would still be easy to understand, we don't *need* to use this it marker each time, but English grammar *demands* it. Japanese does not, hence the 'invisible' が carriage.

    <<∅ pronoun>>
    'It' by itself doesn't really mean anything, we know what it means from context. All of the pronouns I/it/we/he/they can be replaced by an invisible logical particle ([[*Logical particles]]) (most often が) marked /∅ pronoun/. It is important to remember that the が-marked noun *is still there*.

   #+BEGIN_QUOTE
   [∅が]さくらだ - (I) am Sakura
   #+END_QUOTE
    By default 'I' is the default value of this ∅ pronoun. However, if someone were introducing their daughter and said 「さくらだ」 we would understand from context that ∅ meant this/she.

   #+BEGIN_QUOTE
   [∅が]土曜日だ - (Today) is Saturday
   It is Saturday - (Today) is Saturday
   #+END_QUOTE
   From context it is clear that ∅ and 'it' mean 'today'.

* Particles
  No particles other than が and だ can ever be part of the core sentence ([[*Core sentence]]) and only が is present in every sentence (even if invisible ([[Invisible が]]).

** Logical particles
   A logical particle tells us how the sentence logically holds together. It tells us who does what to whom with what, when and where.

   All logical particles attach to nouns, they *cannot* attach to anything but nouns. If we see a logical particle attached to anything else then we know that that word is functionally a noun.

   The noun and the particle attached to it are an inseparable pair. We must view the two together, they are a question and an answer which form a fundamental unit of the Japanese sentence.

   There cannot be a sentence without が, even if sometimes you can't see it. が can work in A is B sentences, as well as A does B sentences. The other particles can *only* work in A does B sentences i.e. that is sentences with a verb engine.
   - が - Who (or what) did it?
   - を - Whom was it done to?
   - に - Where did they go?/Where are they?
   - へ - What direction?
   - で - Where was it done? With what was it done?

*** TODO が (/ga/) - Subject <<が>>
# I may need to dig out the episode to cover this particle
*** TODO だ (/da/) - Copula <<だ>>
*** を (/o/wo/) - (Direct) Object
    The を particle marks the object of the sentence, the /thing/ that some verb (the engine) is being done to. が marks the thing that is doing the verb.
    #+BEGIN_QUOTE
    わたし​*が*​ケエキ​*を*​たべる - I eat cake
    #+END_QUOTE
    The core sentence here is 'I eat'. The extra を particle marked noun, is telling us more about the engine (eat). /What/ are we eating? We are eating cake.

    #+BEGIN_QUOTE
    わたしがぼーる​*を*​なげる - I threw the ball
    #+END_QUOTE
    The core sentence is 'I threw', and the extra を particle marked noun tells us what we threw i.e. the ball.

*** に (/ni/) - Target (Indirect Object)
    The に-particle marks the target (indirect object) of an engine. Along with が and を:
    - が tells us who does the doing
    - を tells us what it is done to
    - に tells us what the ultimate target of that doing

    #+BEGIN_QUOTE
    わたしがぼーるをさくら​*に*​なげる - I threw the ball at/to Sakura
    #+END_QUOTE
    Sakura is the destination, the target. It is important to note here that the logical particles tell us what happened. The order of the words doesn't really matter the way it does in English.

    #+BEGIN_QUOTE
    わたし​*に*​さくらがぼーるをなげる - Sakura threw the ball at/to me.
    #+END_QUOTE
    #+BEGIN_QUOTE
    ぼーるがわたし​*に*​さくらをなげる - The ball throws Sakura at me
    #+END_QUOTE
    Obviously this final example doesn't make any sense (although we might want to say something nonsensical like this in a fantasy novel or something) but we can say whatever we like in Japanese so long as we use the right logical particles.

    If we are going somewhere, or sending something somewhere, or putting something somewhere, we use に.
    #+BEGIN_QUOTE
    [∅が]みせ​*に*​いく - (I) will go to the shop
    #+END_QUOTE

    に gives us the target of an action in the literal sense, and also the target in a volitional sense, i.e. the aim of our action.
    #+BEGIN_QUOTE
    [∅が]みせ​*に*​たまごをかい*に*いく - (I) will go to the shop to buy eggs
    #+END_QUOTE
    かい is the い stem of かう, to buy ([[*Verb stems]]). The logical particles can only mark nouns. The い-stem of a verb is the equivalent noun form of it. Just as in English 'I like swimming', /swimming/ is a noun, 'I go to the shop for the purpose of buying eggs', this /buying/ is also a noun.

    As well as identifying a place we will go to, に can also specify a place we are currently at:
    #+BEGIN_QUOTE
    ∅がみせ​*に*​いる - (I) am/is at the shop
    #+END_QUOTE
    This に is still marking a target, just not a future target. In order for something to be somewhere it must've gotten there, and so に specifies the target of some past action. We can also use this for inanimate objects:
    #+BEGIN_QUOTE
    ほんは∅がテーベルのうえ​*に*​ある - As for the book, (it) exists/is on/at the table.
    #+END_QUOTE
    This use of に also applies to times as well as places, see: /time expressions/ ([[*Time expressions]]).

    Finally, に can also mark a transformation. If /a/ becomes /b/, then に also marks /b/, the thing a is becoming.
    #+BEGIN_QUOTE
    さくらは∅がかえる*に*なった - Sakura became a frog
    #+END_QUOTE
    Of course this example is a bit of a joke, but there are of course various every day things that become other things. This form of expression is also used much more often in Japanese than in English.
    #+BEGIN_QUOTE
    ことし∅が十八さいになる - This year (I) become 18 years old
    #+END_QUOTE
    #+BEGIN_QUOTE
    あとで∅がくもりになる - Later (it (the weather) will) become cloudy
    #+END_QUOTE
    See also how to use 「なる」 with adjectives ([[Becoming an adjective]])

