structured-notes.md

# Table of Contents

1.  [Core sentence](#org935a100)
2.  [Particles](#org057b5e8)
    1.  [Logical particles](#org99460c6)
        1.  [が (*ga*) - Subject ](#org71befda)
        2.  [だ (*da*) - Copula ](#org7747715)
        3.  [を (*o/wo*) - (Direct) Object](#org2b353bd)
        4.  [に (*ni*) - Target (Indirect Object)](#org87201e7)
        5.  [の (*no*) - Possessive](#orgff8c05c)
        6.  [へ (*e*) - Direction](#org4ac2f58)
        7.  [で (*de*) - Means](#orgdbcd990)
    2.  [Non-logical particles](#org9c5a290)
        1.  [は *wa*](#org4e79e4e)
    3.  [Alogical particles](#orgcc79112)
        1.  [と (*to*) - And](#orgc9d837a)
    4.  [Sentence ender particles](#org99deb46)
3.  [Tense](#orgef85912)
        1.  [Non-past (future) tense](#orga22dd6f)
        2.  [Present (continuous)](#org536f5c2)
        3.  [Past](#orgf0e5c42)
        4.  [Negatives](#org0a47ad0)
        5.  [Time expressions](#org93f1d2c)
4.  [て-form](#org00c02db)
5.  [Negative nouns](#org6cb5619)
6.  [Verb stems](#orgd179abd)
7.  [Negative verbs](#org81a1e9e)
8.  [Adjectives](#org7b3dcca)
        1.  [い-adjectives](#org880bf06)
        2.  [Verb-adjectives](#orgdc766f8)
        3.  [Noun-adjectives](#org12580f4)
9.  [Adjective stem, adjective て-form, negative adjectives](#org3f0b12e)
10. [です/ます form](#orgc494daf)


<a id="org935a100"></a>

# Core sentence

Every sentence is formed of two elements, they are the が-marked noun and the *engine*.

In all languages there are only two kinds of sentence:

-   A **is** B i.e. Sakura is Japanese
-   A **does** B i.e. Sakura Walks

> さくらが日本人だ - Sakura is Japanese

> さくらが歩く - Sakura walks

There are three possible engines:

-   Verb - A does B
-   だ-marked noun - A is B
-   い-&ldquo;Adjective&rdquo; ([8](#org7b3dcca)) - A is B

The engine **always** comes at the end of the sentence (with the exception of sentence ender particles ([2.4](#org99deb46)).

<a id="org3615cfa"></a>
The が-marked noun is not always visible in the sentence. It is still present as part of the core of the sentence however. The closest English equivalent to this invisible が is &rsquo;it&rsquo;. Take this example English sentence:

> The ball rolled down the hill. When the ball got to the bottom the ball hit a sharp stone and the ball was punctured and all the air came out of the ball.

This is not a sentence we would ever say in English, once we have established that we are talking about &rsquo;the ball&rsquo; we would instead refer to the ball by &rsquo;it&rsquo;:

> The ball rolled down the hill. When it got to the bottom it hit a sharp stone and it was punctured and all the air came out of it.

If we were to completely omit &rsquo;it&rsquo; the sentence would still be easy to understand, we don&rsquo;t **need** to use this it marker each time, but English grammar **demands** it. Japanese does not, hence the &rsquo;invisible&rsquo; が carriage.

<a id="org52764ab"></a>
&rsquo;It&rsquo; by itself doesn&rsquo;t really mean anything, we know what it means from context. All of the pronouns I/it/we/he/they can be replaced by an invisible logical particle ([2.1](#org99460c6)) (most often が) marked *∅ pronoun*. It is important to remember that the が-marked noun **is still there**.

> [∅が]さくらだ - (I) am Sakura

By default &rsquo;I&rsquo; is the default value of this ∅ pronoun. However, if someone were introducing their daughter and said 「さくらだ」 we would understand from context that ∅ meant this/she.

> [∅が]土曜日だ - (Today) is Saturday
> It is Saturday - (Today) is Saturday

From context it is clear that ∅ and &rsquo;it&rsquo; mean &rsquo;today&rsquo;.


<a id="org057b5e8"></a>

# Particles

No particles other than が and だ can ever be part of the core sentence ([1](#org935a100)) and only が is present in every sentence (even if invisible ([1](#org3615cfa)).


<a id="org99460c6"></a>

## Logical particles

A logical particle tells us how the sentence logically holds together. It tells us who does what to whom with what, when and where.

All logical particles attach to nouns, they **cannot** attach to anything but nouns. If we see a logical particle attached to anything else then we know that that word is functionally a noun.

The noun and the particle attached to it are an inseparable pair. We must view the two together, they are a question and an answer which form a fundamental unit of the Japanese sentence.

There cannot be a sentence without が, even if sometimes you can&rsquo;t see it. が can work in A is B sentences, as well as A does B sentences. The other particles can **only** work in A does B sentences i.e. that is sentences with a verb engine.

-   が - Who (or what) did it?
-   を - Whom was it done to?
-   に - Where did they go?/Where are they?
-   へ - What direction?
-   で - Where was it done? With what was it done?


<a id="org71befda"></a>

### TODO が (*ga*) - Subject <a id="org6cbd714"></a>


<a id="org7747715"></a>

### TODO だ (*da*) - Copula <a id="orga46bc43"></a>


<a id="org2b353bd"></a>

### を (*o/wo*) - (Direct) Object

The を particle marks the object of the sentence, the *thing* that some verb (the engine) is being done to. が marks the thing that is doing the verb.

> わたし​**が**​ケエキ​**を**​たべる - I eat cake

The core sentence here is &rsquo;I eat&rsquo;. The extra を particle marked noun, is telling us more about the engine (eat). *What* are we eating? We are eating cake.

> わたしがぼーる​**を**​なげる - I threw the ball

The core sentence is &rsquo;I threw&rsquo;, and the extra を particle marked noun tells us what we threw i.e. the ball.


<a id="org87201e7"></a>

### に (*ni*) - Target (Indirect Object)

The に-particle marks the target (indirect object) of an engine. Along with が and を:

-   が tells us who does the doing
-   を tells us what it is done to
-   に tells us what the ultimate target of that doing

> わたしがぼーるをさくら​**に**​なげる - I threw the ball at/to Sakura

Sakura is the destination, the target. It is important to note here that the logical particles tell us what happened. The order of the words doesn&rsquo;t really matter the way it does in English.

> わたし​**に**​さくらがぼーるをなげる - Sakura threw the ball at/to me.

> ぼーるがわたし​**に**​さくらをなげる - The ball throws Sakura at me

Obviously this final example doesn&rsquo;t make any sense (although we might want to say something nonsensical like this in a fantasy novel or something) but we can say whatever we like in Japanese so long as we use the right logical particles.

If we are going somewhere, or sending something somewhere, or putting something somewhere, we use に.

> [∅が]みせ​**に**​いく - (I) will go to the shop

に gives us the target of an action in the literal sense, and also the target in a volitional sense, i.e. the aim of our action.

> [∅が]みせ​**に**​たまごをかい\*に\*いく - (I) will go to the shop to buy eggs

かい is the い stem of かう, to buy ([6](#orgd179abd)). The logical particles can only mark nouns. The い-stem of a verb is the equivalent noun form of it. Just as in English &rsquo;I like swimming&rsquo;, *swimming* is a noun, &rsquo;I go to the shop for the purpose of buying eggs&rsquo;, this *buying* is also a noun.

As well as identifying a place we will go to, に can also specify a place we are currently at:

> ∅がみせ​**に**​いる - (I) am/is at the shop

This に is still marking a target, just not a future target. In order for something to be somewhere it must&rsquo;ve gotten there, and so に specifies the target of some past action. We can also use this for inanimate objects:

> ほんは∅がテーベルのうえ​**に**​ある - As for the book, (it) exists/is on/at the table.

This use of に also applies to times as well as places, see: *time expressions* ([3.0.5](#org93f1d2c)).

Finally, に can also mark a transformation. If *a* becomes *b*, then に also marks *b*, the thing a is becoming.

> さくらは∅がかえる\*に\*なった - Sakura became a frog

Of course this example is a bit of a joke, but there are of course various every day things that become other things. This form of expression is also used much more often in Japanese than in English.

> ことし∅が十八さいになる - This year (I) become 18 years old

> あとで∅がくもりになる - Later (it (the weather) will) become cloudy

See also how to use 「なる」 with adjectives ([9](#orgdda472a))
