structured-notes.org
*** の (/no/) - Possessive
    The の particle, or the /possessive particle/ functions just like the English /'s/.
    #+BEGIN_QUOTE
    さくら​*の*​はな - Sakura's nose
    #+END_QUOTE
    #+BEGIN_QUOTE
    わたし​*の*​はな - Me's (my) nose
    #+END_QUOTE
    Luckily in Japanese we don't have to worry about his/her/my/their, we just use の.

    <<の-adjectives>>
    Because this is the /possessive particle/ we can use this in another slightly different way. 「あか」 has an /adjectival/ form in 「あかい」, but not all colours have this form. The Japanese for pink, 「ピンクいる」 (lit: pink-colour) doesn't have an adjectival form in 「ピンクいろい」, nor can we use it as a secondary engine with な. So what are we to do? Well we can use the の-particle:
    #+BEGIN_QUOTE
    ピンクいる​*の*​どれすが - The pink dress (literally: The dress belonging to the class of pink things)
    #+END_QUOTE
    #+BEGIN_QUOTE
    うさぎ​*の*​OSCAR - Oscar the rabbit (literally: Oscar belonging to the class of rabbit)
    #+END_QUOTE

*** へ (/e/) - Direction
    This is a very simple particle, it duplicates a single use of に. When we say /a is going to b/ we can freely substitute に with へ. This is *all* is can do, it cannot even mark the case where something /is/, only where it is /going/.
*** で (/de/) - Means
    #+BEGIN_QUOTE
    [∅が]こうえんにいく - I go to the park
    #+END_QUOTE
    If we say 'I went by bus' or 'I ate with chopsticks' we use で for the thing we did it with, the means by which we performed the action.
    #+BEGIN_QUOTE
    [∅が]バス​*で*​こうえんにいく - I go to the park by bus
    #+END_QUOTE

** Non-logical particles
   Non-logical particles are not part of the logical structure of a sentence. They are neither the thing we are saying something about, nor what we are saying about it. They also do not tell us more about the engine of the sentence as the other logical particles do.

*** は /wa/
    The は-particle can be thought of as a /flag/. It simply marks something as the topic of the sentence, but doesn't say anything about it.

    An exact translation of the は particle would be 'As for /x/'. 「わたしは」 therefore means 'As for me', *not* 'I am' (わたしが).

    A commonly mistranslated sentence is:
    #+BEGIN_QUOTE
    わたし​*は*​日本人だ - +I am Japanese+
    #+END_QUOTE
    Referring back to the core sentence ([[*Core sentence]]) we can see that the が-marked noun so we don't actually know who or what the subject is. One may ask /'well why don't we just treat the は particle as if it is marking the subject'/. In this example it is obvious that the topic marked by は is the same as the subject marked by が, but there are many more cases where this is not true, leading to much confusion down the road. Let's look at a similar sentence. You are at a restaurant, the waitress is asking what you would like:
    #+BEGIN_QUOTE
    わたし​*は*​うなぎだ - +I am an eel+
    #+END_QUOTE
    Treating は as 'I am' doesn't work. As we now know the default value of the ∅ pronoun is 'I', but in this context it's clear that we're talking instead about /what/ we want to eat. 「わたしはうなぎだ」 therefore means 'As for me, eel'.
    #+BEGIN_QUOTE
    わたし​*は*​[∅が]日本人だ - As for me, (I) am Japanese
    #+END_QUOTE
    #+BEGIN_QUOTE
    わたし​*は*​[∅が]うなぎだ - As for me, (what I would like to order) is eel
    #+END_QUOTE

    #+BEGIN_QUOTE
    わたし​*は*​[∅が]さくらにぼーるをなける - As for me, (I) threw the ball at Sakura
    #+END_QUOTE
    #+BEGIN_QUOTE
    ぼーる​*は*​わたしがさくらに[∅を]なける - As for the ball, I threw (it) at Sakura
    #+END_QUOTE
    This time the を marked noun (not the が marked noun) has become invisible([[Invisible が]]), because what we're throwing is now marked by the は particle, ∅ here has taken the value of 'it'. Even without は we might already know what 'it' was that was thrown from context. The important thing to understand here is that as we change the logical particles from one noun to another we change the meaning of the sentence, but when we change the non-logical particle は from one noun to another it makes no difference to the logic of the sentence. It may make some difference to the emphasis, but it makes no difference to who is doing what or what they're doing it to.

** Alogical particles
*** と (/to/) - And
    Alogical particles aren't simply markers. The と the particle 'ands' two nouns together. It is therefore doing something in the sentence, it is joining a noun to another noun and inheriting its logical particle, but the と particle has no function of its own.
    #+BEGIN_QUOTE
    さくら​*と*​メイリー​*が*​あるいていた - Sakura *and* Mary were walking
    #+END_QUOTE

** TODO Sentence ender particles
* Tense
   In Japanese the tenses are not the same past, present and future tenses we're familiar with from English.

*** Non-past (future) tense
    The basic, dictionary-form of verbs are in the /non-past/ tense. The Japanese non-past tense is very similar to the English non-past tense. What is the /English/ non-past tense? It is again the plain dictionary form of a verb: /eat/, /run/, /walk/ etc. It is unnatural in English to say 'I eat cake', to mean 'I am eating cake'. It is natural however to use the non-past tense to say 'Sometimes I eat cake' or, in the explicitly future tense 'I will eat cake'. Japanese is just the same as English in this way. It is rare we use this form for talking about things actually happening right now, except in cases like literary descriptions.

    Just as the ∅ pronoun ([[∅ pronoun]]) defaults to 'I', the non-past tense defaults to the future.
    #+BEGIN_QUOTE
    さくらが歩く - Sakura will walk
    #+END_QUOTE
    #+BEGIN_QUOTE
    犬がたべる - Dog will eat
    #+END_QUOTE
    'Sakura walks' is possible, but isn't the most natural way.

*** Present (continuous)
    In order to say something like 'Sakura is walking' we need to combine the verb 「歩く」 - /to walk/ with the verb 「いる」 -  /to be/. This is done by putting the verb into the て-form ([[*て-form]]).
    #+BEGIN_QUOTE
    さくらが歩いている - Sakura is walking
    #+END_QUOTE
    #+BEGIN_QUOTE
    犬がたべている - Dog is eating
    #+END_QUOTE
    The core sentence here is 'Sakura is existing', the て-form verb, what we shall call a /secondary engine/ which modifies the main engine. In what state is Sakura existing? She is existing in the state of eating.

    # TODO Add a link here to the expanded secondary engine write-up (if one gets written)

*** Past
    <<Verb past>>
    To form the past tense of a verb we need to take the verb stem([[*Verb stems]]) and add た.
    #+BEGIN_QUOTE
    犬がたべた - The dog ate
    #+END_QUOTE

    <<Adjective past>>
    If we want to put an adjective into the past tense we drop the い and add かった.
    #+BEGIN_QUOTE
    こわい ー> こわかった - Was scary
    #+END_QUOTE

*** Negatives
    Because 「ない」 is also an adjective, the past tense of it is just 「なかった」.
    | Non-past             | Past                     |          |
    |----------------------+--------------------------+----------|
    | さくらがはしる       | さくらがはしった         | Positive |
    | さくらがはし*ら*ない | さくらがはし*ら*なかった | Negative |

    As we know 「さくらがはしる」 is not very natural Japanese, instead we would say 「さくらがはしっている」. For this, all we need to do is put the 「いる」 into the past tense:
    #+BEGIN_QUOTE
    さくらがはしっている -> さくらがはしっていた - Sakura was running
    #+END_QUOTE

