structured-notes.md


<a id="orgff8c05c"></a>

### の (*no*) - Possessive

The の particle, or the *possessive particle* functions just like the English *&rsquo;s*.

> さくら​**の**​はな - Sakura&rsquo;s nose

> わたし​**の**​はな - Me&rsquo;s (my) nose

Luckily in Japanese we don&rsquo;t have to worry about his/her/my/their, we just use の.

<a id="org16bd88e"></a>
Because this is the *possessive particle* we can use this in another slightly different way. 「あか」 has an *adjectival* form in 「あかい」, but not all colours have this form. The Japanese for pink, 「ピンクいる」 (lit: pink-colour) doesn&rsquo;t have an adjectival form in 「ピンクいろい」, nor can we use it as a secondary engine with な. So what are we to do? Well we can use the の-particle:

> ピンクいる​**の**​どれすが - The pink dress (literally: The dress belonging to the class of pink things)

> うさぎ​**の**​OSCAR - Oscar the rabbit (literally: Oscar belonging to the class of rabbit)


<a id="org4ac2f58"></a>

### へ (*e*) - Direction

This is a very simple particle, it duplicates a single use of に. When we say *a is going to b* we can freely substitute に with へ. This is **all** is can do, it cannot even mark the case where something *is*, only where it is *going*.


<a id="orgdbcd990"></a>

### で (*de*) - Means

> [∅が]こうえんにいく - I go to the park

If we say &rsquo;I went by bus&rsquo; or &rsquo;I ate with chopsticks&rsquo; we use で for the thing we did it with, the means by which we performed the action.

> [∅が]バス​**で**​こうえんにいく - I go to the park by bus


<a id="org9c5a290"></a>

## Non-logical particles

Non-logical particles are not part of the logical structure of a sentence. They are neither the thing we are saying something about, nor what we are saying about it. They also do not tell us more about the engine of the sentence as the other logical particles do.


<a id="org4e79e4e"></a>

### は *wa*

The は-particle can be thought of as a *flag*. It simply marks something as the topic of the sentence, but doesn&rsquo;t say anything about it.

An exact translation of the は particle would be &rsquo;As for *x*&rsquo;. 「わたしは」 therefore means &rsquo;As for me&rsquo;, **not** &rsquo;I am&rsquo; (わたしが).

A commonly mistranslated sentence is:

> わたし​**は**​日本人だ - <del>I am Japanese</del>

Referring back to the core sentence ([1](#org935a100)) we can see that the が-marked noun so we don&rsquo;t actually know who or what the subject is. One may ask *&rsquo;well why don&rsquo;t we just treat the は particle as if it is marking the subject&rsquo;*. In this example it is obvious that the topic marked by は is the same as the subject marked by が, but there are many more cases where this is not true, leading to much confusion down the road. Let&rsquo;s look at a similar sentence. You are at a restaurant, the waitress is asking what you would like:

> わたし​**は**​うなぎだ - <del>I am an eel</del>

Treating は as &rsquo;I am&rsquo; doesn&rsquo;t work. As we now know the default value of the ∅ pronoun is &rsquo;I&rsquo;, but in this context it&rsquo;s clear that we&rsquo;re talking instead about *what* we want to eat. 「わたしはうなぎだ」 therefore means &rsquo;As for me, eel&rsquo;.

> わたし​**は**​[∅が]日本人だ - As for me, (I) am Japanese

> わたし​**は**​[∅が]うなぎだ - As for me, (what I would like to order) is eel

> わたし​**は**​[∅が]さくらにぼーるをなける - As for me, (I) threw the ball at Sakura

> ぼーる​**は**​わたしがさくらに[∅を]なける - As for the ball, I threw (it) at Sakura

This time the を marked noun (not the が marked noun) has become invisible([1](#org3615cfa)), because what we&rsquo;re throwing is now marked by the は particle, ∅ here has taken the value of &rsquo;it&rsquo;. Even without は we might already know what &rsquo;it&rsquo; was that was thrown from context. The important thing to understand here is that as we change the logical particles from one noun to another we change the meaning of the sentence, but when we change the non-logical particle は from one noun to another it makes no difference to the logic of the sentence. It may make some difference to the emphasis, but it makes no difference to who is doing what or what they&rsquo;re doing it to.


<a id="orgcc79112"></a>

## Alogical particles


<a id="orgc9d837a"></a>

### と (*to*) - And

Alogical particles aren&rsquo;t simply markers. The と the particle &rsquo;ands&rsquo; two nouns together. It is therefore doing something in the sentence, it is joining a noun to another noun and inheriting its logical particle, but the と particle has no function of its own.

> さくら​**と**​メイリー​**が**​あるいていた - Sakura **and** Mary were walking


<a id="org99deb46"></a>

## TODO Sentence ender particles


<a id="orgef85912"></a>

# Tense

In Japanese the tenses are not the same past, present and future tenses we&rsquo;re familiar with from English.


<a id="orga22dd6f"></a>

### Non-past (future) tense

The basic, dictionary-form of verbs are in the *non-past* tense. The Japanese non-past tense is very similar to the English non-past tense. What is the *English* non-past tense? It is again the plain dictionary form of a verb: *eat*, *run*, *walk* etc. It is unnatural in English to say &rsquo;I eat cake&rsquo;, to mean &rsquo;I am eating cake&rsquo;. It is natural however to use the non-past tense to say &rsquo;Sometimes I eat cake&rsquo; or, in the explicitly future tense &rsquo;I will eat cake&rsquo;. Japanese is just the same as English in this way. It is rare we use this form for talking about things actually happening right now, except in cases like literary descriptions.

Just as the ∅ pronoun ([1](#org52764ab)) defaults to &rsquo;I&rsquo;, the non-past tense defaults to the future.

> さくらが歩く - Sakura will walk

> 犬がたべる - Dog will eat

&rsquo;Sakura walks&rsquo; is possible, but isn&rsquo;t the most natural way.


<a id="org536f5c2"></a>

### Present (continuous)

In order to say something like &rsquo;Sakura is walking&rsquo; we need to combine the verb 「歩く」 - *to walk* with the verb 「いる」 -  *to be*. This is done by putting the verb into the て-form ([4](#org00c02db)).

> さくらが歩いている - Sakura is walking

> 犬がたべている - Dog is eating

The core sentence here is &rsquo;Sakura is existing&rsquo;, the て-form verb, what we shall call a *secondary engine* which modifies the main engine. In what state is Sakura existing? She is existing in the state of eating.


<a id="orgf0e5c42"></a>

### Past

<a id="org91a7fe8"></a>
To form the past tense of a verb we need to take the verb stem([6](#orgd179abd)) and add た.

> 犬がたべた - The dog ate

<a id="orgdaa261b"></a>
If we want to put an adjective into the past tense we drop the い and add かった.

> こわい ー> こわかった - Was scary


<a id="org0a47ad0"></a>

### Negatives

Because 「ない」 is also an adjective, the past tense of it is just 「なかった」.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Non-past</th>
<th scope="col" class="org-left">Past</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">さくらがはしる</td>
<td class="org-left">さくらがはしった</td>
<td class="org-left">Positive</td>
</tr>


<tr>
<td class="org-left">さくらがはし*ら*ない</td>
<td class="org-left">さくらがはし*ら*なかった</td>
<td class="org-left">Negative</td>
</tr>
</tbody>
</table>

As we know 「さくらがはしる」 is not very natural Japanese, instead we would say 「さくらがはしっている」. For this, all we need to do is put the 「いる」 into the past tense:

> さくらがはしっている -> さくらがはしっていた - Sakura was running
