structured-notes.org
*** Time expressions
    If we want to make it clear that we are talking about a future event we can add a time expression. By prefixing a sentence with あした (tomorrow), we can make it clear that what we will be doing, we will be doing tomorrow.
    #+BEGIN_QUOTE
    あした[∅が]ケーキをたべる - Tomorrow I will eat cake
    #+END_QUOTE
    Note how we simply preface the sentence with 'tomorrow', just like we would in English. This is the case with all /relative-time nouns/, 'yesterday', 'tomorrow', 'the day after tomorrow', 'next week', next month', 'next year'.

    For /non-relative/, i.e. /absolute/ time expressions we must use the に-particle:
    #+BEGIN_QUOTE
    火曜日​*に*​[∅が]ケーキをたべる - On Tuesday I will eat cake
    #+END_QUOTE
    We must attach に in all the same places we would attach on/in/at in English. 'On Tuesday', 'in March', 'at 12 o'clock'. Fortunately in Japanese we only need to use the one particle.

* て-form
    Japanese verbs fall into three groups: /Ichidan/, /Godan/, and /irregular/

    The first group are /ichidan/ (lit: one level) verbs. Morphing these verbs is easy, we simply remove the る and add our new ending. Ichidan verbs can only end in either いる or える (phonetically).

    The second group is by far the largest, the /godan/ (lit: five level) verbs. This group contains verbs that end in all of the possible verb endings: う つ る - ぬ ぶ む - く ぐ - す. Each of these ending groups has its own way of being morphed, though although they're 'five level' verbs, two of the groups use the same method so we only need to learn 4 methods. Confusingly this means that godan verbs can end in いる or える, most of these will still be /ichidan/ verbs, and fortunately even if a verb is morphed incorrectly, you will probably still be understood.
    - う つ る -> って
    - ぬ ぶ む -> んで
    - く/ぐ -> いて/いで (Note: this is the combined group)
    - す -> して

    There are only two irregular verbs, くる and する. いく, is partly irregular, but not completely.
    - くる -> きて
    - する -> して
    - いく -> いって (+いいて+)
    These are the only exceptions
* Negative nouns
    The fundamental basis of negatives is the adjective 「ない」. This adjective means 'non-exist'. The word for exist (for any inanimate thing) is ある. If we want to say that something exists:
    #+BEGIN_QUOTE
    ぺんがある
    #+END_QUOTE
    But if we want to say that something doesn't exist we say:
    #+BEGIN_QUOTE
    ぺんがない
    #+END_QUOTE
    Now, why do we use a verb for being, and an adjective for non-being? This is something that happens all throughout Japanese, when we do something we use a verb, but when we don't do something we attach ない and are therefore using an adjective as the engine of the sentence. This has a very logical reason, when we *do* something, an action is taking place, and so we use a verb, but when we *don't do* it we are describing a state of non-action, so that's an adjective.

    Above we have said 'There is no pen', how do we say 'This is not a pen'?
    #+BEGIN_QUOTE
    これはぺんがある - As for this, it's a pen
    #+END_QUOTE
    #+BEGIN_QUOTE
    これはぺんではない - As for this, as for being a pen, it's not. (Note: で is the て-form of だ)
    #+END_QUOTE

    # TODO Add link to jyanai secrion
* Verb stems
   Note: these stems apply to godan verbs. For ichidan verbs just drop the る.

    Every verb ends in one of the う-row kana. Here is the kana-grid (う-row kana that aren't used as verb endings have been removed), presented on its side.
    | あ | い | *う* | え | お |
    | か | き | *く* | け | こ |
    | さ | し | *す* | せ | そ |
    | た | ち | *つ* | て | と |
    | な | に | *ぬ* | ね | の |
    | ば | び | *ぶ* | べ | ぼ |
    | ま | み | *む* | め | も |
    | ら | り | *る* | れ | ろ |
    As we can see there are four other ways in which the verb could end. These are the verb stems. For now we're only looking at the あ-stem as this is the one we need for the negative.

    To from the あ-stem we simply shift the final kana from the う-row to the あ-row. There is one only exception and this is the only exception in the entire stem system. This exception is that う itself does not become あ but わ. This is because, take for example a verb like 「かう」, 「かあ」 would not be as easy to say as 「かわ」. Every other う-row kana is simply changed to its あ-row equivalent.
    | **わ** | い | *う* | え | お |
    | *か*   | き | *く* | け | こ |
    | *さ*   | し | *す* | せ | そ |
    | *た*   | ち | *つ* | て | と |
    | *な*   | に | *ぬ* | ね | の |
    | *ば*   | び | *ぶ* | べ | ぼ |
    | *ま*   | み | *む* | め | も |
    | *ら*   | り | *る* | れ | ろ |
* Negative verbs
   To make a verb negative we must attach 「ない」 to the あ-stem of the verb ([[*Verb stems]]).
   #+BEGIN_QUOTE
   かう ー> かわない
   #+END_QUOTE
   #+BEGIN_QUOTE
   はなす ー> はなさない
   #+END_QUOTE

   Remember for ichidan verbs we don't need to form a stem and just drop the る:
   #+BEGIN_QUOTE
   たべる ー> たべない
   #+END_QUOTE

* Adjectives
   Japanese adjectives are not the same as English adjectives. As we have learned Japanese sentences come in three kinds, depending on the type of engine they have. All three of these engines can be used like adjectives.
   - Verb ([[*Verb-adjectives]]) - A *does* B
   - だ-marked noun ([[*Noun-adjectives]]) - A *is* B
   - い-"Adjective" ([[*い-adjectives]]) - A *is* B

*** い-adjectives
   Let's start with the first one, the one we refer to as an adjective in English, the い-engine:
   #+BEGIN_QUOTE
   ぺんがあかい - Pen is red
   #+END_QUOTE
   An important note, 「あかい」 does not mean 'red', it means 'is red'. 「あか」 means red.

   If we swap the order of 「ぺんが」 and 「あかい」 then we can take this い-engine, and now use it not as the primary engine, but as a secondary engine. This would not be a complete sentence however without a new engine, for example, a new (primary) い engine.
   #+BEGIN_QUOTE
   あかいぺんがちいさい - Red pen is small
   #+END_QUOTE

*** Verb-adjectives
   Any verb in any tense can be used like an adjective:
   #+BEGIN_QUOTE
   しょうじょがうたった - Girl sang
   #+END_QUOTE
   #+BEGIN_QUOTE
   うたったしょうじょが... - The girl who sang... (Note: this sentence is not yet complete, it lacks a primary engine).
   #+END_QUOTE
   #+BEGIN_QUOTE
   うたったしょうじょがねている - The girl who sang is sleeping
   #+END_QUOTE

   Verbal adjectives can create very complex sentences in which we can use entire other-sentences (clauses) in an adjectival manner.
   # TODO Show an example

