structured-notes.md


<a id="org93f1d2c"></a>

### Time expressions

If we want to make it clear that we are talking about a future event we can add a time expression. By prefixing a sentence with あした (tomorrow), we can make it clear that what we will be doing, we will be doing tomorrow.

> あした[∅が]ケーキをたべる - Tomorrow I will eat cake

Note how we simply preface the sentence with &rsquo;tomorrow&rsquo;, just like we would in English. This is the case with all *relative-time nouns*, &rsquo;yesterday&rsquo;, &rsquo;tomorrow&rsquo;, &rsquo;the day after tomorrow&rsquo;, &rsquo;next week&rsquo;, next month&rsquo;, &rsquo;next year&rsquo;.

For *non-relative*, i.e. *absolute* time expressions we must use the に-particle:

> 火曜日​**に**​[∅が]ケーキをたべる - On Tuesday I will eat cake

We must attach に in all the same places we would attach on/in/at in English. &rsquo;On Tuesday&rsquo;, &rsquo;in March&rsquo;, &rsquo;at 12 o&rsquo;clock&rsquo;. Fortunately in Japanese we only need to use the one particle.


<a id="org00c02db"></a>

# て-form

Japanese verbs fall into three groups: *Ichidan*, *Godan*, and *irregular*

The first group are *ichidan* (lit: one level) verbs. Morphing these verbs is easy, we simply remove the る and add our new ending. Ichidan verbs can only end in either いる or える (phonetically).

The second group is by far the largest, the *godan* (lit: five level) verbs. This group contains verbs that end in all of the possible verb endings: う つ る - ぬ ぶ む - く ぐ - す. Each of these ending groups has its own way of being morphed, though although they&rsquo;re &rsquo;five level&rsquo; verbs, two of the groups use the same method so we only need to learn 4 methods. Confusingly this means that godan verbs can end in いる or える, most of these will still be *ichidan* verbs, and fortunately even if a verb is morphed incorrectly, you will probably still be understood.

-   う つ る -> って
-   ぬ ぶ む -> んで
-   く/ぐ -> いて/いで (Note: this is the combined group)
-   す -> して

There are only two irregular verbs, くる and する. いく, is partly irregular, but not completely.

-   くる -> きて
-   する -> して
-   いく -> いって (<del>いいて</del>)

These are the only exceptions


<a id="org6cb5619"></a>

# Negative nouns

The fundamental basis of negatives is the adjective 「ない」. This adjective means &rsquo;non-exist&rsquo;. The word for exist (for any inanimate thing) is ある. If we want to say that something exists:

> ぺんがある

But if we want to say that something doesn&rsquo;t exist we say:

> ぺんがない

Now, why do we use a verb for being, and an adjective for non-being? This is something that happens all throughout Japanese, when we do something we use a verb, but when we don&rsquo;t do something we attach ない and are therefore using an adjective as the engine of the sentence. This has a very logical reason, when we **do** something, an action is taking place, and so we use a verb, but when we **don&rsquo;t do** it we are describing a state of non-action, so that&rsquo;s an adjective.

Above we have said &rsquo;There is no pen&rsquo;, how do we say &rsquo;This is not a pen&rsquo;?

> これはぺんがある - As for this, it&rsquo;s a pen

> これはぺんではない - As for this, as for being a pen, it&rsquo;s not. (Note: で is the て-form of だ)


<a id="orgd179abd"></a>

# Verb stems

Note: these stems apply to godan verbs. For ichidan verbs just drop the る.

Every verb ends in one of the う-row kana. Here is the kana-grid (う-row kana that aren&rsquo;t used as verb endings have been removed), presented on its side.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">あ</td>
<td class="org-left">い</td>
<td class="org-left"><b>う</b></td>
<td class="org-left">え</td>
<td class="org-left">お</td>
</tr>


<tr>
<td class="org-left">か</td>
<td class="org-left">き</td>
<td class="org-left"><b>く</b></td>
<td class="org-left">け</td>
<td class="org-left">こ</td>
</tr>


<tr>
<td class="org-left">さ</td>
<td class="org-left">し</td>
<td class="org-left"><b>す</b></td>
<td class="org-left">せ</td>
<td class="org-left">そ</td>
</tr>


<tr>
<td class="org-left">た</td>
<td class="org-left">ち</td>
<td class="org-left"><b>つ</b></td>
<td class="org-left">て</td>
<td class="org-left">と</td>
</tr>


<tr>
<td class="org-left">な</td>
<td class="org-left">に</td>
<td class="org-left"><b>ぬ</b></td>
<td class="org-left">ね</td>
<td class="org-left">の</td>
</tr>


<tr>
<td class="org-left">ば</td>
<td class="org-left">び</td>
<td class="org-left"><b>ぶ</b></td>
<td class="org-left">べ</td>
<td class="org-left">ぼ</td>
</tr>


<tr>
<td class="org-left">ま</td>
<td class="org-left">み</td>
<td class="org-left"><b>む</b></td>
<td class="org-left">め</td>
<td class="org-left">も</td>
</tr>


<tr>
<td class="org-left">ら</td>
<td class="org-left">り</td>
<td class="org-left"><b>る</b></td>
<td class="org-left">れ</td>
<td class="org-left">ろ</td>
</tr>
</tbody>
</table>

As we can see there are four other ways in which the verb could end. These are the verb stems. For now we&rsquo;re only looking at the あ-stem as this is the one we need for the negative.

To from the あ-stem we simply shift the final kana from the う-row to the あ-row. There is one only exception and this is the only exception in the entire stem system. This exception is that う itself does not become あ but わ. This is because, take for example a verb like 「かう」, 「かあ」 would not be as easy to say as 「かわ」. Every other う-row kana is simply changed to its あ-row equivalent.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><b>わ</b></b></td>
<td class="org-left">い</td>
<td class="org-left"><b>う</b></td>
<td class="org-left">え</td>
<td class="org-left">お</td>
</tr>


<tr>
<td class="org-left"><b>か</b></td>
<td class="org-left">き</td>
<td class="org-left"><b>く</b></td>
<td class="org-left">け</td>
<td class="org-left">こ</td>
</tr>


<tr>
<td class="org-left"><b>さ</b></td>
<td class="org-left">し</td>
<td class="org-left"><b>す</b></td>
<td class="org-left">せ</td>
<td class="org-left">そ</td>
</tr>


<tr>
<td class="org-left"><b>た</b></td>
<td class="org-left">ち</td>
<td class="org-left"><b>つ</b></td>
<td class="org-left">て</td>
<td class="org-left">と</td>
</tr>


<tr>
<td class="org-left"><b>な</b></td>
<td class="org-left">に</td>
<td class="org-left"><b>ぬ</b></td>
<td class="org-left">ね</td>
<td class="org-left">の</td>
</tr>


<tr>
<td class="org-left"><b>ば</b></td>
<td class="org-left">び</td>
<td class="org-left"><b>ぶ</b></td>
<td class="org-left">べ</td>
<td class="org-left">ぼ</td>
</tr>


<tr>
<td class="org-left"><b>ま</b></td>
<td class="org-left">み</td>
<td class="org-left"><b>む</b></td>
<td class="org-left">め</td>
<td class="org-left">も</td>
</tr>


<tr>
<td class="org-left"><b>ら</b></td>
<td class="org-left">り</td>
<td class="org-left"><b>る</b></td>
<td class="org-left">れ</td>
<td class="org-left">ろ</td>
</tr>
</tbody>
</table>


<a id="org81a1e9e"></a>

# Negative verbs

To make a verb negative we must attach 「ない」 to the あ-stem of the verb ([6](#orgd179abd)).

> かう ー> かわない

> はなす ー> はなさない

Remember for ichidan verbs we don&rsquo;t need to form a stem and just drop the る:

> たべる ー> たべない


<a id="org7b3dcca"></a>

# Adjectives

Japanese adjectives are not the same as English adjectives. As we have learned Japanese sentences come in three kinds, depending on the type of engine they have. All three of these engines can be used like adjectives.

-   Verb ([8.0.2](#orgdc766f8)) - A **does** B
-   だ-marked noun ([8.0.3](#org12580f4)) - A **is** B
-   い-&ldquo;Adjective&rdquo; ([8.0.1](#org880bf06)) - A **is** B


<a id="org880bf06"></a>

### い-adjectives

Let&rsquo;s start with the first one, the one we refer to as an adjective in English, the い-engine:

> ぺんがあかい - Pen is red

An important note, 「あかい」 does not mean &rsquo;red&rsquo;, it means &rsquo;is red&rsquo;. 「あか」 means red.

If we swap the order of 「ぺんが」 and 「あかい」 then we can take this い-engine, and now use it not as the primary engine, but as a secondary engine. This would not be a complete sentence however without a new engine, for example, a new (primary) い engine.

> あかいぺんがちいさい - Red pen is small


<a id="orgdc766f8"></a>

### Verb-adjectives

Any verb in any tense can be used like an adjective:

> しょうじょがうたった - Girl sang

> うたったしょうじょが&#x2026; - The girl who sang&#x2026; (Note: this sentence is not yet complete, it lacks a primary engine).

> うたったしょうじょがねている - The girl who sang is sleeping

Verbal adjectives can create very complex sentences in which we can use entire other-sentences (clauses) in an adjectival manner.
