structured-notes.org
*** Noun-adjectives
   <<な-adjectives>>
   #+BEGIN_QUOTE
   いぬがやんちゃだ - The dog is naughty
   #+END_QUOTE
   We can turn 「やんちゃ」 into an adjective too, but there is one important thing to note. Just as we have to add だ to a noun to use it as an engine, here we must add な to the noun to use it as an adjective. な is in fact the connective form of だ. Don't be fooled by so-called 'な-adjectives', they're simply nouns! /Adjectival/ nouns.
   #+BEGIN_QUOTE
   やんちゃ​*な*​いぬが... - The dog who is naughty... (Note: this sentence is not yet complete, it lacks a primary engine).
   #+END_QUOTE
   #+BEGIN_QUOTE
   やんちゃ​*な*​いぬがねている - The dog who is naughty is sleeping
   #+END_QUOTE

   An important note is that we cannot do this with /all/ nouns, only nouns which are frequently used in an adjectival way. This group of nouns is what are referred to as 'な-adjectives'. We can use all nouns as adjectives, but for the rest we need to use a different technique, /の-adjectives/ ([[の-adjectives]]).
   # TODO use org's duplication function here for の-adjectives

* Adjective stem, adjective て-form, negative adjectives
   The adjective stem is simple, just drop the い and add く. This is how we make the て form, 「あかい」 ー> 「あかくて」, and it's also the way we make the negative, 「あかい」 ー> 「あかくない」.

   # Add link here
   The only exception (besides ます) is いい (is good), which has an older form, which is still widely used in よい. When we morph いい it becomes よい again:
   #+BEGIN_QUOTE
   いい ー> よくない - Not-good
   #+END_QUOTE
   #+BEGIN_QUOTE
   いい ー> よかった - Was-good
   #+END_QUOTE
   Note: 「よかった」 is a common phrase: 「∅がよかった」 - /It was good (That went well, it turned out great etc.)/

   # TODO: Rename this section to adjectives as nouns?
   <<Becoming an adjective>>
   If we want to say 'Sakura became beautiful' we can't use に because 「うつくしい」 isn't a noun ([[*Logical particles]]), it's an engine. To use 「うつくしい」 as a noun we must convert it to its stem 「うつくしく」.
   #+BEGIN_QUOTE
   さくらがうつくしくなった - Sakura became beautiful
   #+END_QUOTE

* TODO です/ます form
   # TODO Add the bit from notes 'the only exceptions'
