structured-notes.md


<a id="org12580f4"></a>

### Noun-adjectives

<a id="org61fec24"></a>

> いぬがやんちゃだ - The dog is naughty

We can turn 「やんちゃ」 into an adjective too, but there is one important thing to note. Just as we have to add だ to a noun to use it as an engine, here we must add な to the noun to use it as an adjective. な is in fact the connective form of だ. Don&rsquo;t be fooled by so-called &rsquo;な-adjectives&rsquo;, they&rsquo;re simply nouns! *Adjectival* nouns.

> やんちゃ​**な**​いぬが&#x2026; - The dog who is naughty&#x2026; (Note: this sentence is not yet complete, it lacks a primary engine).

> やんちゃ​**な**​いぬがねている - The dog who is naughty is sleeping

An important note is that we cannot do this with *all* nouns, only nouns which are frequently used in an adjectival way. This group of nouns is what are referred to as &rsquo;な-adjectives&rsquo;. We can use all nouns as adjectives, but for the rest we need to use a different technique, *の-adjectives* ([2.1.5](#org16bd88e)).


<a id="org3f0b12e"></a>

# Adjective stem, adjective て-form, negative adjectives

The adjective stem is simple, just drop the い and add く. This is how we make the て form, 「あかい」 ー> 「あかくて」, and it&rsquo;s also the way we make the negative, 「あかい」 ー> 「あかくない」.

The only exception (besides ます) is いい (is good), which has an older form, which is still widely used in よい. When we morph いい it becomes よい again:

> いい ー> よくない - Not-good

> いい ー> よかった - Was-good

Note: 「よかった」 is a common phrase: 「∅がよかった」 - *It was good (That went well, it turned out great etc.)*

<a id="orgdda472a"></a>
If we want to say &rsquo;Sakura became beautiful&rsquo; we can&rsquo;t use に because 「うつくしい」 isn&rsquo;t a noun ([2.1](#org99460c6)), it&rsquo;s an engine. To use 「うつくしい」 as a noun we must convert it to its stem 「うつくしく」.

> さくらがうつくしくなった - Sakura became beautiful


<a id="orgc494daf"></a>

# TODO です/ます form

